We experienced a similar issue after v3.12.0 released at March. To avoid unwanted destroys, we limited vcd provider version as follows:

```
    # old
    vcd = {
      source  = "vmware/vcd"
      version = ">= 3.9.0, < 4.0.0"
    }

    # new
    vcd = {
      source  = "vmware/vcd"
      version = ">= 3.9.0, < 3.12.0"
    }
```
But now, our infrastructure team needs to upgrade vcloud director version to 10.6 and current vcd provider version(v3.11.0) is incompatible with 10.6. So we need to revert this version limit.

However, we hesitate to face unwanted destroys. Besides using ignore_changes as a workaround, as suggested by @carmine73, are there other way to prevent this? Is it expected that upgrades affect VMs previously provisioned with older versions?


You can see the output of related plan:
```

# module.cluster-01.module.couchbase-data.module.servers[3].vcd_vapp_vm.server must be replaced
-/+ resource "vcd_vapp_vm" "server" {
   ~ computer_name                  = "couchbase-72235-base-531-001" -> (known after apply)
   + consolidate_disks_on_create    = false # forces replacement
   + cpu_limit                      = (known after apply)
   + cpu_priority                   = (known after apply)
```